src/Enums/ВидыНастроекИнтеграцииSlack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыНастроекИнтеграцииSlack</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПользовательId</Name>
					<Comment>Идентификатор пользователя в Slack</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольноеЧисло</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыНастроекИнтеграцииSlack/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
 
Функция ПолучитьДанныеНастройки(знач НастройкаСсылка) Экспорт
	
	МенеджерОбъекта		= Перечисления.ВидыНастроекИнтеграцииSlack;
	СтруктураНастройки	= Новый Структура("Настройка, Пользователь, ИмяРесурса, Типы, Формат",
		Неопределено, Ложь, "", Неопределено, "");
	
	Типы = Новый Массив;
	
	Если НастройкаСсылка = МенеджерОбъекта.ПользовательId Тогда
		Типы.Добавить(Тип("Строка"));
		
		СтруктураНастройки.ИмяРесурса	= "ЗначениеСтрока20";
	ИначеЕсли НастройкаСсылка = МенеджерОбъекта.КонтрольноеЧисло Тогда
		Типы.Добавить(Тип("Число"));
		
		СтруктураНастройки.ИмяРесурса	= "ЗначениеЧисло";
		СтруктураНастройки.Формат		= "ЧДЦ=0; ЧН=0; ЧГ=";
	//ИначеЕсли НастройкаСсылка = МенеджерОбъекта.ИспользоватьDHTMLX И ЗначениеЗаполнено(ПодсистемаДанные) Тогда
	//	Типы.Добавить(Тип("Булево"));
	//	
	//	СтруктураНастройки.Подсистема	= ПодсистемаДанные;
	//	СтруктураНастройки.ИмяРесурса	= "ЗначениеБулево";
	//ИначеЕсли НастройкаСсылка = МенеджерОбъекта.ИспользоватьПомещения Тогда
	//	Типы.Добавить(Тип("Булево"));
	//	
	//	СтруктураНастройки.Подсистема	= ПодсистемаДанные;
	//	СтруктураНастройки.ИмяРесурса	= "ЗначениеБулево";
	//ИначеЕсли НастройкаСсылка = МенеджерОбъекта.НачалоРабочегоВремени
	//	ИЛИ НастройкаСсылка = МенеджерОбъекта.ОкончаниеРабочегоВремени Тогда
	//	Типы.Добавить(Тип("Число"));
	//	
	//	СтруктураНастройки.Подсистема	= ПодсистемаИнтерфейс;
	//	СтруктураНастройки.ИмяРесурса	= "ЗначениеЧисло";
	//ИначеЕсли НастройкаСсылка = МенеджерОбъекта.РабочиеДни Тогда
	//	Типы.Добавить(Тип("Строка"));
	//	
	//	СтруктураНастройки.Подсистема	= ПодсистемаИнтерфейс;
	//	СтруктураНастройки.ИмяРесурса	= "ЗначениеСтрока";
	//ИначеЕсли НастройкаСсылка = МенеджерОбъекта.ЦветКалендаря Тогда
	//	Типы.Добавить(Тип("СправочникСсылка.ЦветоваяГаммаПланировщика"));
	//	
	//	СтруктураНастройки.Подсистема	= ПодсистемаДанные;
	//	СтруктураНастройки.ИмяРесурса	= "ЗначениеСсылка";
	//ИначеЕсли НастройкаСсылка = МенеджерОбъекта.ПериодРасписания Тогда
	//	Типы.Добавить(Тип("Число"));
	//	
	//	СтруктураНастройки.Подсистема	= ПодсистемаИнтерфейс;
	//	СтруктураНастройки.ИмяРесурса	= "ЗначениеЧисло";
	КонецЕсли;
	
	СтруктураНастройки.Типы			= Типы;
	СтруктураНастройки.Настройка	= НастройкаСсылка;
	СтруктураНастройки.Пользователь	= ПолучитьПризнакНастройкиПоПользователю(НастройкаСсылка);
	
	Возврат СтруктураНастройки;
	
КонецФункции

Функция ПолучитьНастройкиПользователей() Экспорт
	МассивНастроек	= Новый Массив;
	МассивНастроек.Добавить(Перечисления.ВидыНастроекИнтеграцииSlack.ПользовательId); 
	
	Возврат МассивНастроек;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПризнакНастройкиПоПользователю(НастройкаСсылка)
	МассивНастроек = ПолучитьНастройкиПользователей();
	Возврат (МассивНастроек.Найти(НастройкаСсылка) <> Неопределено);
КонецФункции

#КонецОбласти

#КонецЕсли
